archive/before-2018-11-10/2017-08-24-emacs-use-mu4e.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-08-24-emacs-use-mu4e</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-08-24-emacs-use-mu4e</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge2623a8">1. 中文搜索设置</a></li>
<li><a href="#org6f8e792">2. mu4e快捷键</a></li>
<li><a href="#org9f565dd">3. 处理附件</a></li>
<li><a href="#org3eb5d43">4. 如何搜索</a></li>
<li><a href="#org8e7557e">5. 重新index邮件</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge2623a8" class="outline-2">
<h2 id="orge2623a8"><span class="section-number-2">1</span> 中文搜索设置</h2>
<div class="outline-text-2" id="text-1">
<p>
需要设置一个环境变量，emacs中这样设置：
</p>
<div class="org-src-container">
<pre class="src src-elisp">    (setenv <span style="color: #ff4ea3;">"XAPIAN_CJK_NGRAM"</span> <span style="color: #ff4ea3;">"1"</span>)
</pre>
</div>

<p>
shell中直接 <code>export XAPIAN_CJK_NGRAM=1</code> 就可以了。
</p>

<p>
搜索中文件的时候不能直接输入中文。需要使用条件搜索。先看看 <code>mu help
  find</code> 的例子：
</p>
<pre class="example">
    Some examples:
     # get all messages with 'bananas' in body, subject or recipient fields:
     $ mu find bananas

     # get all messages regarding bananas from John with an attachment:
     $ mu find from:john flag:attach bananas

     # get all messages with subject wombat in June 2009
     $ mu find subject:wombat date:20090601..20090630

    See the `mu-find' and `mu-easy' man-pages for more information.
</pre>

<p>
实际测试中，使用 <code>b:中文</code> 可以搜到内容中的中文。（没有空格）
</p>

<p>
实际测试中，使用 <code>s: 中文</code> 可以搜到subject（抬头）中的中文。（有空格）
</p>

<p>
好像使用 <code>b:中文</code> 更全面一点。
</p>

<p>
其实直接搜中文都可以的。这个需要再看下mu4e的搜索规则。
</p>
</div>
</div>

<div id="outline-container-org6f8e792" class="outline-2">
<h2 id="org6f8e792"><span class="section-number-2">2</span> mu4e快捷键</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
    Using the below key bindings, you can do various things with these
    messages; these actions are also listed in the Headers menu in the
    emacs menu bar.

    key          description
    ===========================================================
    n,p          view the next, previous message
    ],[          move to the next, previous unread message
    y            select the message view (if it's visible)
    RET          open the message at point in the message view

    searching
    ---------
    s            search
    S            edit last query
    /            narrow the search
    b            search bookmark
    B            edit bookmark before search
    j            jump to maildir
    M-left,\     previous query
    M-right      next query

    O            change sort order
    P            toggle threading
    Q            toggle full-search
    V            toggle skip-duplicates
    W            toggle include-related

    marking
    -------
    d            mark for moving to the trash folder
    =            mark for removing trash flag ('untrash')
    DEL,D        mark for complete deletion
    m            mark for moving to another maildir folder
    r            mark for refiling
    +,-          mark for flagging/unflagging
    ?,!          mark message as unread, read

    u            unmark message at point
    U            unmark *all* messages

    %            mark based on a regular expression
    T,t          mark whole thread, subthread

    &lt;insert&gt;,*   mark for 'something' (decide later)
    #            resolve deferred 'something' marks

    x            execute actions for the marked messages

    composition
    -----------
    R,F,C        reply/forward/compose
    E            edit (only allowed for draft messages)


    misc
    ----
    ;            switch focus
    a            execute some custom action on a header
    |            pipe message through shell command
    C-+,C--      increase / decrease the number of headers shown
    H            get help
    C-S-u        update mail &amp; reindex
    q            leave the headers buffer
</pre>

<p>
我常用的：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">describe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">e</td>
<td class="org-left">保存光标所在的副件</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">goto url use `browse-url'</td>
</tr>

<tr>
<td class="org-left">A</td>
<td class="org-left">对附件做自定义操作</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">对邮件的操作</td>
</tr>

<tr>
<td class="org-left">回车</td>
<td class="org-left">应该是直接使用默认浏览器访问链接</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9f565dd" class="outline-2">
<h2 id="org9f565dd"><span class="section-number-2">3</span> 处理附件</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
    5.3 Opening and saving attachments

    By default, mu4e uses the xdg-open-program 26 or (on MacOS) the open program for opening attachments. If you want to use another program, you do so by setting the MU_PLAY_PROGRAM environment variable to the program to be used.

    The default directory for extracting (saving) attachments is your home directory (~/); you can change this using the variable mu4e-attachment-dir, for example:

    (setq mu4e-attachment-dir  "~/Downloads")

    For more flexibility, mu4e-attachment-dir can also be a user-provided function. This function receives two parameters: the file-name and the mime-type as found in the e-mail message27 of the attachment, either or both of which can be nil. For example:

    (setq mu4e-attachment-dir
      (lambda (fname mtype)
        (cond
          ;; docfiles go to ~/Desktop
          ((and fname (string-match "\\.doc$" fname))  "~/Desktop")
          ;; ... other cases  ...
          (t "~/Downloads")))) ;; everything else

    You can extract multiple attachments at once by prefixing the extracting command by C-u; so C-u e asks you for a range of attachments to extract (for example, 1 3-6 8). The range "‘a’" is a shortcut for all attachments.
</pre>
<p>
我是这样设置的：
</p>
<div class="org-src-container">
<pre class="src src-elisp">    (<span style="color: #a1db00;">setq</span> mu4e-attachment-dir
      (<span style="color: #a1db00;">lambda</span> (fname mtype)
        (<span style="color: #a1db00;">cond</span>
          <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">zip and rar file go to ~/Downloads</span>
          ((<span style="color: #a1db00;">and</span> fname (string-match <span style="color: #ff4ea3;">"\\.zip$"</span> fname))  <span style="color: #ff4ea3;">"~/Downloads"</span>)
          ((<span style="color: #a1db00;">and</span> fname (string-match <span style="color: #ff4ea3;">"\\.rar$"</span> fname))  <span style="color: #ff4ea3;">"~/Downloads"</span>)

          <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">document to and rar file go to ~/Documents</span>
          ((<span style="color: #a1db00;">and</span> fname (string-match <span style="color: #ff4ea3;">"\\.pdf$"</span> fname))  <span style="color: #ff4ea3;">"~/Documents"</span>)
          ((<span style="color: #a1db00;">and</span> fname (string-match <span style="color: #ff4ea3;">"\\.doc$"</span> fname))  <span style="color: #ff4ea3;">"~/Documents"</span>)

          <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">... other cases  ...</span>
          (t <span style="color: #ff4ea3;">"/tmp"</span>)))) <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">everything else</span>
</pre>
</div>

<p>
这样可以使用 <code>C-u e</code> 来保存所有附件。
</p>
</div>
</div>

<div id="outline-container-org3eb5d43" class="outline-2">
<h2 id="org3eb5d43"><span class="section-number-2">4</span> 如何搜索</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
7.1 Queries

mu4e queries are the same as the ones that mu find understands^30.
Let’s look at some examples here, please refer to the mu-find and
mu-easy man pages for details and more examples.

  * Get all messages regarding bananas:
   
    bananas
    
  * Get all messages regarding bananas from John with an attachment:
   
    from:john flag:attach bananas
    
  * Get all messages with subject wombat in June 2009
   
    subject:wombat date:20090601..20090630
    
  * Get all messages with PDF attachments in the /projects folder
   
    maildir:/projects mime:application/pdf
    
  * Get all messages about Rupert in the /Sent Items folder. Note
    that maildirs with spaces must be quoted.
   
    maildir:"/Sent Items" rupert
    
  * Get all important messages which are signed:
   
    flag:signed prio:high
    
  * Get all messages from Jim without an attachment:
   
    from:jim AND NOT flag:attach
    
  * Get all messages with Alice in one of the contacts-fields (to,
    from, cc, bcc):
   
    contact:alice
    
  * Get all unread messages where the subject mentions Ångström:
    (search is case-insensitive and accent-insensitive, so this
    matches Ångström, angstrom, aNGstrøM, ...)
   
    subject:Ångström flag:unread
    
  * Get all unread messages between Mar-2002 and Aug-2003 about some
    bird:
   
    date:20020301..20030831 nightingale flag:unread
    
  * Get today’s messages:
   
    date:today..now
    
    or, unless you have a really old Xapian
   
    date:today
    
  * Get all messages we got in the last two weeks regarding emacs:
   
    date:2w..now emacs
    
    or, unless you have a really old Xapian
   
    date:2w.. emacs
    
  * Get messages from the Mu mailing list:
   
    list:mu-discuss.googlegroups.com
    
    Note - in the Headers view you may see the ’friendly name’ for a
    list; however, when searching you need the real name. You can see
    the real name for a mailing list from the friendly name’s
    tool-tip.
   
  * Get messages with a subject soccer, Socrates, society, ...; note
    that the ’*’-wildcard can only appear as a term’s rightmost
    character:
   
    subject:soc*
    
  * Get all messages not sent to a mailing-list:
   
    NOT flag:list
    
  * Get all mails with attachments with filenames starting with pic;
    note that the ’*’ wildcard can only appear as the term’s
    rightmost character:
   
    file:pic*
    
  * Get all messages with PDF-attachments:
   
    mime:application/pdf
    
    Get all messages with image attachments, and note that the ’*’
    wildcard can only appear as the term’s rightmost character:
   
    mime:image/*
</pre>
</div>
</div>

<div id="outline-container-org8e7557e" class="outline-2">
<h2 id="org8e7557e"><span class="section-number-2">5</span> 重新index邮件</h2>
<div class="outline-text-2" id="text-5">
<p>
使用过程中，我只遇到过一次，index不知道怎么被搞坏了。
</p>

<ol class="org-ol">
<li>我先删了原来的index，应该是 <code>~/.mu</code> 目录。</li>
<li>然后使用 !mu index &#x2013;maildir=~/mutt_mail! 来重新index。</li>
<li>最后在mu4e中按 <code>U</code> 重新update一下就ok了。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>